docs/nubank.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-22 Mon 01:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nubank</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Docker image runner" />
</head>
<body>
<div id="content">
<h1 class="title">Nubank</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org04e8da3">1. Environment</a></li>
<li><a href="#org7860b60">2. Main RC file</a></li>
<li><a href="#org101e324">3. Aliases and functions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org04e8da3" class="outline-2">
<h2 id="org04e8da3"><span class="section-number-2">1</span> Environment</h2>
<div class="outline-text-2" id="text-1">
<p>
On nubank we use many custom tools, so it is pretty amazing to have the option to start working directly with minimal scripts that would give us access to the whole ecosystem, maybe this shouldn't be here in an org-mode file (mainly because is auto-generated code) but just for the sake of having a simplified manage, let's create the main env-vars directly in here.
</p>

<p>
The main variables are related to the location of the tooling and projects:
</p>
<div class="org-src-container">
<pre class="src src-shell">export NU_HOME="$HOME/dev/nu"
export NU_COUNTRY="mx"
export NU_ENV="prod"
export NUCLI_HOME="$NU_HOME/nucli"
</pre>
</div>

<p>
which for instance should be included in the main path of the computer
</p>
<div class="org-src-container">
<pre class="src src-shell">export PATH="$NUCLI_HOME:$PATH"
</pre>
</div>

<p>
Also we have some tooling related to Golang
</p>
<div class="org-src-container">
<pre class="src src-shell">export GOPATH="$HOME/go"
export PATH="$GOPATH/bin:$PATH"
</pre>
</div>

<p>
Just to be sure, we have three new blocks, one for NVM, one for android and one for RBenv
</p>
<div class="org-src-container">
<pre class="src src-shell">export NVM_DIR="$HOME/.nvm"
[ -s "$(brew --prefix)/opt/nvm/nvm.sh" ] &amp;&amp; . "$(brew --prefix)/opt/nvm/nvm.sh"
</pre>
</div>

<p>
The one for android
</p>
<div class="org-src-container">
<pre class="src src-shell">export ANDROID_HOME="$HOME/Library/Android/sdk"
export ANDROID_SDK="$ANDROID_HOME"
export PATH="$PATH:$ANDROID_HOME/cmdline-tools/latest/bin:$ANDROID_HOME:$ANDROID_HOME/platform-tools:$ANDROID_HOME/emulator"
</pre>
</div>

<p>
The block for RBenv
</p>
<div class="org-src-container">
<pre class="src src-shell">eval "$(rbenv init -)"
</pre>
</div>

<p>
And given that we are working on the mobile side of the env-vars, it would be great to just add the main monorepo variables and the flutter vars.
</p>
<div class="org-src-container">
<pre class="src src-shell">export MONOREPO_ROOT="${NU_HOME}/mini-meta-repo"
export PATH="$PATH:$MONOREPO_ROOT/monocli/bin"

export FLUTTER_SDK_HOME="$HOME/sdk-flutter"
export FLUTTER_ROOT="$FLUTTER_SDK_HOME"
export PATH="$PATH:$FLUTTER_SDK_HOME/bin:$HOME/.pub-cache/bin:$FLUTTER_ROOT/bin/cache/dart-sdk/bin"
</pre>
</div>
</div>
</div>

<div id="outline-container-org7860b60" class="outline-2">
<h2 id="org7860b60"><span class="section-number-2">2</span> Main RC file</h2>
<div class="outline-text-2" id="text-2">
<p>
Even when we already defined some variables it seems that a good practice is to start defining which files should be loaded only if they have some valuable configuration
</p>

<div class="org-src-container">
<pre class="src src-shell">[[ -s $HOME/.nurc ]] &amp;&amp; source $HOME/.nurc
[[ -s $HOME/.nubank_aliases ]] &amp;&amp; source $HOME/.nubank_aliases
[[ -s $HOME/.nubank_functions ]] &amp;&amp; source $HOME/.nubank_functions
</pre>
</div>

<p>
Let's add the other nucli tools too, just in case that we could have that project cloned
</p>
<div class="org-src-container">
<pre class="src src-shell">if [[ -d "$NU_HOME/nucli.py/bin" ]]; then
    export PATH="$PATH:$NU_HOME/nucli.py/bin"
fi
</pre>
</div>

<p>
if we have those included, that implies that we already have the nu projects and some nubank specific env-vars, for instance this would work:
</p>
<div class="org-src-container">
<pre class="src src-shell"># &lt;-- BEGIN SECTION ADDED BY NUDEV --&gt;

# To handle non-ASCII characters
# ==============================
export LC_ALL="en_US.UTF-8"
export LANG="en_US.UTF-8"


# Programs
# ========

# Default editor
# --------------
export EDITOR="subl -w -n"

# Homebrew
# --------
if command -v brew &gt;/dev/null ; then
  HOMEBREW_PREFIX="$(brew --prefix)"
  export PATH="${HOMEBREW_PREFIX}/sbin:${PATH}"
elif [[ -f "/opt/homebrew/bin/brew" &amp;&amp; $(/usr/bin/uname -sm) == "Darwin arm64" ]]; then
  eval "$(/opt/homebrew/bin/brew shellenv)"
  export PATH="${HOMEBREW_PREFIX}/sbin:${PATH}"
fi

# SDKMAN
# ------
if [[ -f "$HOME/.sdkman/bin/sdkman-init.sh" &amp;&amp; $(/usr/bin/uname -sm) == "Darwin arm64" ]]; then
  source "$HOME/.sdkman/bin/sdkman-init.sh"
fi

# jEnv
# ----
if command -v jenv &gt;/dev/null; then
  export PATH="${HOME}/.jenv/bin:${PATH}"
  eval "$(jenv init -)"
fi

# rbenv
# -----
if command -v rbenv &gt;/dev/null; then eval "$(rbenv init -)"; fi

# node
# ----
# https://nodejs.org/api/modules.html
if command -v node &gt;/dev/null &amp;&amp; [[ -n "$HOMEBREW_PREFIX" ]]; then
  export NODE_PATH="${HOMEBREW_PREFIX}/lib/node_modules"
fi

# Autocomplete
# ============

# https://docs.brew.sh/Shell-Completion
if command -v brew &gt;/dev/null &amp;&amp; [[ $(ps -p "$$" -o comm=) == *bash ]]; then

  case $- in
  *e*) set_e=true &amp;&amp; set +e ;;
  *) set_e=false ;;
  esac

  for completion_file in "${HOMEBREW_PREFIX}/etc/bash_completion.d"/*; do
    source "${completion_file}"
  done

  # bash-completion@2
  if [[ -r "${HOMEBREW_PREFIX}/etc/profile.d/bash_completion.sh" ]]; then
    . "${HOMEBREW_PREFIX}/etc/profile.d/bash_completion.sh" || :
  fi

  [[ "${set_e}" == true ]] &amp;&amp; set -e

fi

if [[ -r "${NUCLI_HOME}/nu.bashcompletion" ]]; then
  . "${NUCLI_HOME}/nu.bashcompletion" || :
fi

# &lt;-- END SECTION ADDED BY NUDEV --&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org101e324" class="outline-2">
<h2 id="org101e324"><span class="section-number-2">3</span> Aliases and functions</h2>
<div class="outline-text-2" id="text-3">
<p>
There are some actions that are performed too often, so it is way better if we can define some specific aliases that would help us to avoid the mind load that would represent memorizing all of those commands:
</p>
<div class="org-src-container">
<pre class="src src-shell">alias nrt="nu-mx auth get-refresh-token --env prod"
alias nrts="nu-mx auth get-refresh-token --env staging"
alias ngt="nu-mx auth get-access-token --env prod"
alias ngts="nu-mx auth get-access-token --env staging"
alias orm="nu-mx aws credentials refresh --okta"
</pre>
</div>

<p>
And that implies too, that it would be pretty great to have custom functions (with parameters) to execute another common actions
</p>
<div class="org-src-container">
<pre class="src src-shell">cdp() {
    cd "$NU_HOME/$1"
}

clone() {
    nu proj clone $1
    cdp $1
}

watch-ser() {
    # $1 is the prototype and $2 is the service-name
    watch -n 2 nu-mx k8s get pods $1 $2
}

cycle() {
    # $1 is the prototype and $2 is the service-name
    nu-mx k8s cycle $1 $2
}

last-image() {
    nu-mx registry list-images nu-$1 | sed -n 2p | cut -d ' ' -f1
}

redeploy() {
    nu-mx service rainmaker update $1 $2 $(last-image $2)
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Docker image runner</p>
<p class="date">Created: 2022-08-22 Mon 01:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
